#define _CRT_SECURE_NO_WARNINGS 1

//char        //字符数据类型
//short       //短整型
//int         //整形
//long        //长整型
//long long   //更长的整形
//float       //单精度浮点数
//double      //双精度浮点数


//char
//unsigned char
//signed char
//short
//unsigned short[int]
//signed short[int]
//int
//unsigned int
//signed int
//long
//unsigned long[int]
//signed long [int]

//原码、反码、补码
//计算机中的有符号数有三种表示方法，即原码、反码和补码。
//三种表示方法均有符号位和数值位两部分，符号位都是用0表示“正”，用1表示“负”，而数值位
//三种表示方法各不相同。
//原码
//直接将二进制按照正负数的形式翻译成二进制就可以。
//反码
//将原码的符号位不变，其他位依次按位取反就可以得到了
//补码
//反码 + 1就得到补码。
//正数的原、反、补码都相同。
//对于整形来说：数据存放内存中其实存放的是补码

//int main()
//{
//	int num  = 10;//创建一个整型变量，叫num，这时num向内存申请4个字节来存放数据
//	//4个字节-32比特位
//	//00000000000000000000000000001010-原码
//	//00000000000000000000000000001010-反码
//	//00000000000000000000000000001010-补码
//
//	int num2 = -10;//
//	//10000000000000000000000000001010 - 原码
//	//11111111111111111111111111110101 - 反码  符号位不变 其他按位取反
//	//11111111111111111111111111110110 - 补码  反码加1
//	//
//
//
//	return 0;
//}

//#include<stdio.h>
//int main()
//{
//	int num  = 10;//创建一个整型变量，叫num，这时num向内存申请4个字节来存放数据
//	return 0;
//}


//#include<stdio.h>
//int main()
//{
//	int a = 1;
//	//用二进制表示 00000000000000000000000000000001
//	//用16进制表示 0x 00 00 00 01
//	//如果是小端 那低位放低地址
//	//如果是大端 那低位放高地址
//	char* p = (char*)&a;
//	if (*p == 1)
//	{
//		printf("小端\n");
//	}
//	else
//		printf("大端\n");
//	return 0;
//}


//#include<stdio.h>
//int check_sys()
//{
//	int a = 1;
//	return *(char*)&a;
//}
//int main()
//{
//	int ret = check_sys();
//	if (ret == 1)
//		printf("小端\n");
//	else
//		printf("大端\n");
//}

//输出什么？
//#include <stdio.h>
//int main()
//{
//    char a = -1;
//    // 1原码 10000000000000000000000000000001
//    //  反码 11111111111111111111111111111110
//    //  补码 11111111111111111111111111111111
//    // 因为是char类型 只要八个比特网 所以截断
//    //     a-->                      11111111
//    //整形提升 高位补充符号位 因为是%d打印
//    // 补码  11111111111111111111111111111111
//    // 反码  11111111111111111111111111111110
//    // 原码  10000000000000000000000000000001  值为-1 
//    signed char b = -1;
//    // b的原理和a一样的
//    unsigned char c = -1;
//    //11111111 -c
//    //整型提升 char 是无符号的  所以高位补0
//    //00000000000000000000000011111111 补码 原码 值为255
//    //无符号数 是正数  所以原码反码补码都一样
//    printf("a=%d,b=%d,c=%d", a, b, c);
//    return 0;
//}


//#include <stdio.h> 
//int main()
//{
//	char a = -128;
//	//10000000000000000000000010000000 原码
//	//11111111111111111111111101111111 反码
//	//11111111111111111111111110000000 补码
//	// 截断
//	//10000000
//	//整形提升
//	//11111111111111111111111110000000
//	printf("%u\n", a);
//	//11111111111111111111111110000000  打印无符号 所有位都是有效位
//	// %u 以十进制的形式打印无符号整形
//	return 0;
//}

//输出什么
//#include <stdio.h> 
//int main()
//{
//	char a = 128;
//	//00000000000000000000000010000000 原码 补码
//	//截断
//	//10000000
//	//整形提升
//	//11111111111111111111111110000000
//	printf("%u\n", a);
//	return 0;
//}

//输出什么？
//int main()
//{
//	int i = -20;
//	unsigned int j = 10;
//    printf("%d\n", i + j);
//}

//输出什么？
//#include<stdio.h>
//int main()
//{
//	unsigned int i;
//	for (i = 9; i >= 0; i--)
//	{
//		printf("%u\n", i);
//		//i=0-1的时候 -1变成无符号整数将是很多的整数
//	}
//}

//输出什么 
//#include<stdio.h>
//int main()
//{
//	char a[1000];
//	int i;
//	for (i = 0; i < 1000; i++)
//	{
//		a[i] = -1 - i;
//	}
//	printf("%d", strlen(a));
//	return 0;
//}


//输出什么？
#include <stdio.h> 
unsigned char i = 0;
int main()
{
	for (i = 0; i <= 255; i++)
	{
		printf("hello world\n");
	}
	return 0;
}